Repository: acastrodev/stride-docs-catproject
Catalog: stride-docs-level2.tmx
Source language: en
Languages: pt_br

source: I[Maintainers Review]
pt_br: I[Revisão dos mantenedores]

source: If possible make sure that images are .webp format and videos are .mp4 format.
pt_br: Se possível, certifique-se de que as imagens estejam no formato webp e os vídeos no formato .mp4.

source: If possible make sure that images are .webp format.
pt_br: Se possível, certifique-se de que as imagens estejam no formato .webp.

source: If so, start the process again by creating a new branch.
pt_br: Se sim, reinicie o processo criando um novo branch.

source: If you are new to scripting, we recommend first exploring the Scripting pages in the manual, where you'll find an introduction to scripting, as well as essential concepts.
pt_br: Se programação de scripts é algo novo para você, recomendamos que primeiro explore as páginas de programação de scripts no manual, onde você encontrará uma introdução ao tema, bem como seus conceitos essenciais.

source: If you are not sure whether your update is small or not, please create an issue first.
pt_br: Se estiver em dúvida se sua alteração é pequena ou não, prefira criar uma issue primeiro.

source: If you are using Visual Studio, you can open Stride.Docs.sln solution file in the root of the repository and start making your updates directly from this IDE.
pt_br: Se estiver utilizando o Visual Studio, é possível abrir o arquivo de solução Stride.Docs.sln, localizado na raiz do repositório, e começar a editar a partir do próprio IDE.

source: If you created a new folder, make sue that you create also index.md file in this folder.
pt_br: Se você criou uma nova pasta, certifique-se também de criar um arquivo index.md dentro dela.

source: If you prefer to use GitHub infrastructure for your demonstrations, refer to our Deployment to GitHub Pages guide for instructions on deploying via GitHub Actions.
pt_br: Caso prefira usar a infraestrutura do GitHub para isso, consulte nosso guia de implantação no GitHub Pages.

source: If you think the address should be valid, let us know.
pt_br: Se você acredita que este endereçodeveria ser válido, por favor, entre em contato

source: If you want to contribute and update the website, please follow the instructions below.
pt_br: Se você deseja contribuir e atualizar o site, siga as instruções abaixo.

source: In addition to the Manual and Tutorial sections mentioned above, the same principles apply to both existing and new sections.
pt_br: Além das seções Manual e Tutorial mencionadas acima, os mesmos princípios se aplicam a seções existentes e novas.

source: In addition to the Scripting pages, you may also find our manual helpful in deepening your understanding of Stride and its features.
pt_br: Além das páginas de Programação de Scripts, você também encontrará nosso manual, que lhe ajudará a aprofundar a compreensão do Stride e de suas funcionalidades.

source: In the Basic Tab
pt_br: Na aba Básico

source: In the Deployment Tab - This step can be completed later if preferred.
pt_br: Na aba Implantação – Esta etapa pode ser feita depois, se preferir.

source: In the Monitoring Tab
pt_br: Na aba Monitorar + proteger

source: In the Review Tab
pt_br: Na aba Revisar + criar

source: In the Tags Tab
pt_br: Na aba Rótulos

source: In your stride-docs repository:
pt_br: No seu repositório stride-docs:

source: Injects the Stride Docs language selection into the top navigation
pt_br: Injeta a seleção de idioma da documentação do Stride na navegação superior

source: Injects the Stride Docs version selection above the filter in the side navigation
pt_br: Injeta a seleção de versão da documentação do Stride acima do filtro na navegação lateral

source: Input
pt_br: Entrada

source: Input/Gameplay
pt_br: Entrada/Jogabilidade

source: Integration/Tools
pt_br: Integração/Ferramentas

source: Interfaces, interactions and 3rd party tools.
pt_br: Interfaces, interações e ferramentas de terceiros.

source: Ireland
pt_br: Irlanda

source: It provides step-by-step instructions for setting up a new Azure Web App, specifically tailored for staging environments.
pt_br: Ele oferece instruções passo a passo para configurar um novo Azure Aplicativo Web, especificamente voltado para ambientes de staging (pré-produção).

source: It will fail at this stage, but this will be resolved in the subsequent steps.
pt_br: Ela falhará neste ponto, mas isso será resolvido nas etapas seguintes.

source: It's essential that these updates accurately reflect the changes to provide users with the latest information on utilizing Stride's capabilities.
pt_br: É essencial que essas atualizações reflitam com precisão as mudanças, fornecendo aos usuários as informações mais recentes sobre como utilizar os recursos do Stride.

source: It's up to the Stride team, alongside our amazing contributors, to make sure that any new contributions bring along updates to the manual.
pt_br: Cabe à equipe do Stride, junto com nossos incríveis colaboradores, garantir que qualquer nova contribuição inclua também as atualizações necessárias no manual.

source: J[Address PR Feedback]
pt_br: J[Responda ao feedback do PR]

source: Japan
pt_br: Japão

source: K[Revise and Update PR as Necessary]
pt_br: K[Revise e atualize o PR se necessário]

source: Keep your fork synchronized with the main repository to avoid conflicts
pt_br: Mantenha seu fork sincronizado com o repositório principal para evitar conflitos.

source: Keeping this document current is vital for ensuring that the release notes are both accurate and exhaustive, thereby streamlining the release process.
pt_br: Manter esse documento atualizado é essencial para garantir que as notas de versão sejam precisas e completas, facilitando o processo de lançamento.

source: Keeping your fork in sync with the upstream ensures compatibility and reduces conflicts.
pt_br: Manter seu fork sincronizado evita conflitos e melhora a compatibilidade.

source: L[Wait for PR to be Merged by Maintainers]
pt_br: L[Aguarde a mesclagem do PR pelos mantenedores]

source: Labelling
pt_br: Rotulação

source: Labels should be applied based on the following rules and order of priority:
pt_br: Os rótulos devem ser aplicadas com base nas seguintes regras e ordem de prioridade:

source: Leave all settings as default
pt_br: Deixe todas as configurações como padrão

source: Leave this blank unless you wish to add tags
pt_br: Deixe em branco, a menos que deseje adicionar rótulos

source: Libraries
pt_br: Bibliotecas

source: Linux related stuff
pt_br: Tópicos relacionados ao Linux

source: Locate the new GitHub Action file (stride-docs/blob/master/.github/workflows/some-file-name.yml) that was automatically generated by Azure Portal.
pt_br: Localize o novo arquivo da GitHub Action (stride-docs/blob/master/.github/workflows/some-file-name.yml) que foi gerado automaticamente pelo Azure Portal.

source: Location
pt_br: Localização

source: M[Sync/Merge Upstream with Your Forked Main Branch]
pt_br: M[Sincronize/Mescle o repositório original com o seu fork do branch main]

source: Major Updates
pt_br: Atualizações maiores

source: Major updates can be defined as significant changes to the website's design, where it's beneficial to preview the impact of your changes to ensure they achieve the desired result.
pt_br: Atualizações maiores envolvem mudanças estruturais no site, onde é útil visualizar o impacto antes de efetivar a alteração.

source: Math
pt_br: Matemática

source: Media
pt_br: Mídia

source: Merging Pull Requests
pt_br: Mesclando pull requests

source: Meshes and Models
pt_br: Malhas e modelos

source: Metrics
pt_br: Métricas

source: Models and Animations
pt_br: Modelos e animações

source: Modifying layouts
pt_br: Modificações em layouts

source: Modifying the GitHub Action
pt_br: Modificando a GitHub Action

source: Monitor the build logs while the action is in progress
pt_br: Acompanhe os logs de compilação enquanto a ação estiver em andamento

source: Monitoring Tab
pt_br: Aba Monitorar + proteger

source: Most engine areas
pt_br: Partes do motor de jogos

source: N[Update or Add relevant Documentation]
pt_br: N[Atualize ou adicione a documentação relevante]

source: Name: stride-docs-staging
pt_br: Nome: stride-docs-staging

source: Naming Convention
pt_br: Convenção de nomes

source: Navigate to Settings → Actions → General → Workflow Permissions
pt_br: Acesse Settings → Actions → General → Workflow Permissions

source: Navigate to Settings → Pages → Branch section
pt_br: cesse Settings → Pages → seção Branch

source: Navigate to the Azure Portal
pt_br: Acesse o Azure Portal

source: Navigate to the repository
pt_br: Acesse o repositório

source: Navigating the Environment
pt_br: Navegando pelo ambiente

source: Netherlands
pt_br: Países Baixos

source: Networking
pt_br: Rede

source: Nodes & Pins
pt_br: Nós e pinos

source: Note that the process for setting up a production environment is similar, but requires a distinct web app name.
pt_br: Observe que o processo para configurar um ambiente de produção é semelhante, mas exige um nome distinto para o aplicativo web.

source: Note the different prefixes for generic and Stride-specific categories:
pt_br: Observe os diferentes prefixos utilizados para as categorias genéricas e as categorias específicas do Stride:

source: O -->|No| Z
pt_br: O -->|Não| Z

source: O -->|Yes| B
pt_br: O -->|Sim| B

source: OS: Windows
pt_br: Sistema Operacional Windows

source: Observe existing pages and folders for the naming convention.
pt_br: Verifique as páginas e pastas existentes para seguir a convenção de nomes.

source: Observe existing tutorials for the content of this file.
pt_br: Verifique os tutoriais existentes para ter uma referência do conteúdo desse arquivo.

source: Observe existing tutorials structure for the content of these files.
pt_br: Verifique a estrutura dos tutoriais existentes para basear o conteúdo desses arquivos.

source: Official video tutorials
pt_br: Tutoriais oficiais em vídeo

source: Oh no, this is embarrassing 🙈!
pt_br: Ops, que constrangedor 🙈!

source: Old projects
pt_br: Projetos antigos

source: Once deployed, share the link with us for review.
pt_br: Após a implantação, compartilhe o link conosco para revisão.

source: Once the PR is merged, the Stride team will apply a label (only one per PR) to categorize the PR based on the type of changes it introduces.
pt_br: Após o PR ser mesclado, a equipe do Stride aplicará um único rótulo para categorizar o PR com base no tipo de alteração introduzida.

source: Open the stride-docs-staging-azure.yml workflow and update it with the values obtained in the previous step.
pt_br: Abra o workflow stride-docs-staging-azure.yml e atualize-o com os valores obtidos na etapa anterior.

source: Optionally, you can add also a custom domain.
pt_br: Opcionalmente, você pode adicionar um domínio personalizado.

source: Other
pt_br: Outros

source: Other Sections
pt_br: Outras seções

source: Our goal is to write minimal CSS code to keep the website lightweight, leveraging the Bootstrap framework to the fullest extent possible.
pt_br: Nosso objetivo é escrever o mínimo possível de código CSS para manter o site leve, aproveitando ao máximo o framework Bootstrap.

source: Our main web assets include:
pt_br: Nossos principais recursos web incluem:

source: Our team has explored various deployment options, ultimately selecting the method detailed in this guide for its efficacy.
pt_br: Nossa equipe explorou diversas opções de implantação, optando, por fim, pelo método descrito neste guia devido à sua eficácia.

source: Overall source generators
pt_br: Geradores de código em geral

source: Overview
pt_br: Visão geral

source: O{Additional Contributions?}
pt_br: O{Gostaria contribuir mais?}

source: PRs with other labels or those that are unlabelled will automatically fall under the Other Changes category.
pt_br: PRs com outros rótulos ou sem rótulos serão automaticamente incluídos na categoria Other Changes.

source: Physics
pt_br: Física

source: Physics, colliders, triggers.
pt_br: Física, colisores, acionadores.

source: Plug Stride into other apps and make magic happen.
pt_br: Conecte o Stride com outros aplicativos e faça acontecer.

source: Plugin system
pt_br: Sistema de plugins

source: Poland
pt_br: Polônia

source: Porting Editor to Avalonia
pt_br: Portabilidade do Editor para Avalonia

source: Prerequisites
pt_br: Pré-requisitos

source: Pricing Plan - An existing App Service Plan should appear if the region and resource group match that of the existing web app.
pt_br: Plano de Preço – Um plano do Serviço de Aplicativo existente deve aparecer, caso a região e o grupo de recursos sejam os mesmos do aplicativo web atual.

source: Proceed to the newly created Web App
pt_br: Acesse o Aplicativo Web recém-criado

source: Project examples
pt_br: Exemplos de projetos

source: Projects
pt_br: Projetos

source: Publish: Code
pt_br: Publicar: Code

source: Region: as the current web
pt_br: Região: a mesma do app web atualizado

source: Release
pt_br: Lançamento

source: Releases
pt_br: Lançamentos

source: Render pipeline
pt_br: Pipeline de renderização

source: Render pipelne
pt_br: Pipeline de renderização

source: Rendering
pt_br: Renderização

source: Rendering and Camera
pt_br: Renderização e câmera

source: Rendering, Camera's, render groups and more.
pt_br: Renderização, câmeras, grupos de renderização e mais.

source: Repositories
pt_br: Repositórios

source: Revamping design elements
pt_br: Reformulação de elementos visuais

source: Review your settings
pt_br: Revise suas configurações

source: Run GitHub Action
pt_br: Executando a GitHub Action

source: Runtime stack: ASP.NET V4.8
pt_br: Pilha de runtime: ASP.NET V4.8

source: Save your changes.
pt_br: Salve as alterações.

source: Scene
pt_br: Cena

source: Select Actions
pt_br: Selecione Actions

source: Select Create a resource
pt_br: Selecione Criar um recurso

source: Select General Settings
pt_br: Selecione Configurações Gerais

source: Select account, organisation Stride, repository stride-docs and branch staging
pt_br: Selecione a conta, organização Stride, repositório stride-docs e branch staging

source: Sets the top navigation icons, such as GitHub, Discord, Twitter
pt_br: Define os ícones da navegação superior, como GitHub, Discord, Twitter

source: Setting up a new Azure Web App
pt_br: Configurando um novo Azure Aplicativo Web

source: Shader system
pt_br: Sistema de shader

source: Shaders
pt_br: Shader multi-malha

source: Shortcodes and Includes
pt_br: Shortcodes e includes

source: Significant changes, such as the introduction of new features or modifications to existing ones, necessitate updates to the Stride user manual.
pt_br: Mudanças significativas, como a introdução de novos recursos ou modificações em funcionalidades existentes, exigem atualizações no manual do usuário do Stride.

source: Small Updates
pt_br: Pequenas atualizações

source: Small updates can be done directly in the GitHub web interface, for bigger updates the local development environment is required, which is described in the Installation section.
pt_br: Pequenas atualizações podem ser feitas diretamente pela interface web do GitHub. Já para atualizações maiores, é necessário configurar um ambiente de desenvolvimento local, conforme descrito na seção Instalação local.

source: Some commonly used features include:
pt_br: Alguns recursos comuns incluem:

source: Spreads & Iteration
pt_br: Propagações e iterações

source: Squashing
pt_br: Squash de commits

source: Start by setting up your local development environment, as described in the Installation section.
pt_br: Comece configurando seu ambiente de desenvolvimento local, conforme descrito na seção Instalação local.

source: Start[Start]
pt_br: Start[Início]

source: Steps
pt_br: Etapas

source: Stride API
pt_br: API do Stride

source: Stride Diagnostics Analyzer
pt_br: Diagnostic Analyzer do Stride

source: Stride's community has made and shared all kinds of awesome stuff over the years.
pt_br: A comunidade do Stride criou e compartilhou coisas incríveis ao longo dos anos.

source: Styling
pt_br: Estilo

source: Submitting your Changes
pt_br: Submetendo suas alterações

source: TR.Stride.Atmosphere - Implementation of UE4 atmosphere rendering
pt_br: TR.Stride.Atmosphere - Implementação da renderização de atmosfera do UE4

source: TR.Stride.Gameplay - Manage save games
pt_br: TR.Stride.Gameplay - Gerenciamento de jogos salvos

source: TR.Stride.Ocean - Ocean Water rendering
pt_br: TR.Stride.Ocean - Renderização de água do oceano

source: TR.Stride.Terrain- Height Map Terrain
pt_br: TR.Stride.Terrain - Terreno com mapa de altura

source: Terrain
pt_br: Terreno

source: Terrain and Water
pt_br: Terreno e água

source: The ReleaseNotesNext.md file is a crucial document that should be continuously updated with summaries of important/major PRs that have been merged and are noteworthy for the community, such as new features.
pt_br: O arquivo ReleaseNotesNext.md é um documento crucial que deve ser continuamente atualizado com resumos dos PRs importantes ou com grandes alterações que foram mesclados e são relevantes para a comunidade, como novos recursos.

source: The toc.yml file contains the table of contents for the tutorial pages, which is displayed on the left side of the tutorial pages.
pt_br: O arquivo toc.yml contém o índice das páginas de tutorial, que é exibido no lado esquerdo das páginas de tutorial.

source: The toc.yml file contains the table of contents for the manual pages, which is displayed on the left side of the manual pages.
pt_br: O arquivo toc.yml contém o índice das páginas do manual, que é exibido no lado esquerdo das páginas do manual.

source: The API documentation covers methods, properties, and other relevant information to help you effectively use the Stride engine in your projects.
pt_br: A documentação da API inclui métodos, propriedades e outras informações relevantes para ajudar a você a utilizar de maneira eficaz o Stride em seus projetos.

source: The CI/CD pipeline is configured to automatically trigger deployments upon merging changes into either the staging or release branches.
pt_br: O pipeline CI/CD está configurado para acionar implantações automaticamente ao mesclar alterações nas branches staging ou release.

source: The GitHub Action will be added to the repository and run automatically.
pt_br: Uma GitHub Action será adicionada ao repositório e executada automaticamente.

source: The Stride Rendering Pipeline
pt_br: Pipeline de renderização do Stride

source: The Stride team prioritizes documentation as part of the PR review process to maintain the accuracy and completeness of information.
pt_br: A equipe do Stride prioriza a documentação como parte do processo de revisão de Pull Requests (PR), a fim de manter a precisão e a integridade das informações.

source: The categorization is set in the release.yml.
pt_br: A categorização é definida no arquivo release.yml.

source: The community has agreed to use a hybrid categorization based on generic categories and Stride-specific categories.
pt_br: A comunidade decidiu usar uma categorização híbrida baseada em categorias genéricas e categorias específicas do Stride.

source: The contribution process involves several key steps, from forking the repository to having your changes merged into the main project.
pt_br: O processo de contribuição envolve várias etapas-chave, desde o fork do repositório até a integração das suas alterações ao projeto principal.

source: The core team is a small group of volunteer developers, each with expertise in different areas of development.
pt_br: A equipe principal é formada por um pequeno grupo de desenvolvedores voluntários, cada um com experiência em diferentes áreas do desenvolvimento.

source: The core team is composed of members who make frequent contributions to the project, whether in code, documentation, or community management.
pt_br: A equipe principal é composta por membros que contribuem com frequência para o projeto — seja com código, documentação ou na gestão da comunidade.

source: The page you're looking for doesn't exist or has been moved to another address.
pt_br: A página que você está procurando não existe ou foi movida.

source: The previous step will have added a GitHub Action to your repository, which might fail initially.
pt_br: A etapa anterior terá adicionado uma GitHub Action ao seu repositório, que pode falhar inicialmente.

source: The template includes sections for a concise summary of your changes, a detailed description, any related issues, the motivation behind the changes, and the types of changes being proposed.
pt_br: Esse modelo inclui seções para um resumo das alterações, uma descrição detalhada, eventuais issues relacionados, a motivação por trás das mudanças e o tipo de alteração proposta.

source: The template is structured to cover:
pt_br: Estrutura do modelo de pull request:

source: The videos should be uploaded to YouTube and embedded in the tutorial pages.
pt_br: Os vídeos devem estar no YouTube e incorporados nas páginas do tutorial.

source: The website will be accessible at https://[your-username].github.io/stride-docs/4.2/en
pt_br: O site estará acessível em https://[seu-usuário].github.io/stride-docs/4.2/en

source: There are no full-time developers solely dedicated to Stride's advancement; instead, the engine progresses through voluntary contributions from both the core team and the wider community.
pt_br: Não há desenvolvedores em tempo integral exclusivamente dedicados ao avanço do Stride; em vez disso, o motor evolui graças às contribuições voluntárias tanto da equipe principal quanto da comunidade em geral.

source: These are projects that definitely will not work with Stride 4.x without massive rewrites but were made with the old versions of Stride FKA Xenko or Paradox game engine.
pt_br: Esses projetos não funcionam com o Stride 4.x sem grandes reescritas. Foram criados com versões antigas do motor Stride, anteriormente conhecido como Xenko ou Paradox.

source: These comments are integral to generating useful API documentation and provide essential guidance directly in the IDE.
pt_br: Esses comentários são essenciais para gerar a documentação da API útil e fornecem orientações diretamente na IDE.

source: These individuals dedicate their spare time to enhancing and expanding the engine, driven by personal interest, passion for the project, and their specialized knowledge.
pt_br: Esses colaboradores dedicam seu tempo livre para aprimorar e expandir o motor, movidos por interesse pessoal, paixão pelo projeto e seu conhecimento técnico especializado.

source: These labels are utilized by GitHub Releases automation to sort changes in the changelog.
pt_br: Esses rótulos são utilizados pela automação do GitHub Releases para organizar as mudanças no changelog.

source: These pages are also included in the optionally generated PDF file.
pt_br: Essas páginas também são incluídas no arquivo PDF gerado opcionalmente.

source: These pages contain detailed information about the Stride scripting API, grouped by namespace.
pt_br: Estas páginas contêm informações detalhadas sobre a API de programação de scripts do Stride, agrupadas por namespace.

source: These pages contain information about how to use Stride, an open-source C# game engine.
pt_br: Essas páginas contêm informações sobre como usar o Stride, um motor de jogos C# de código aberto.

source: These pages contain tutorials on how to use Stride, an open-source C# game engine.
pt_br: Essas páginas contêm tutoriais sobre como usar o Stride, um motor de jogos C# de código aberto.
